# Directcontext3dLoaded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Directcontext3dLoaded Property
ParameterTypeId Class See Also
---
"Loaded"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Directcontext3dLoaded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Directcontext3dLoaded As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Directcontext3dLoaded {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace